In [2]:
import numpy as np
import pandas as pd
df1 = pd.DataFrame([['Pen', 24, 2.39],
                    ['Eraser', 32, 1.29],
                    ['Sharpener', 12, 10.39],
                    ['Pencil', 42, 0.59 ]],
                   index=[100024, 201024, 202034, 101122],
                   columns = ['item', 'inventory', 'unit_price'])
df2 = pd.DataFrame([['Notepad', 12, 4.25],
                    ['Binder', 8, 5.68]],
                   index=[230015, 211040],
                   columns = ['item', 'inventory', 'unit_price'])

In [7]:
df3 = df1.append(df2)

In [8]:
df3

             item  inventory  unit_price
100024        Pen         24        2.39
201024     Eraser         32        1.29
202034  Sharpener         12       10.39
101122     Pencil         42        0.59
230015    Notepad         12        4.25
211040     Binder          8        5.68

In [9]:
df4 = df3.drop([230015, 211040])

In [10]:
df4

             item  inventory  unit_price
100024        Pen         24        2.39
201024     Eraser         32        1.29
202034  Sharpener         12       10.39
101122     Pencil         42        0.59